### Importing libraries and data

In [1]:
# Import libararies

import pandas as pd
import numpy as np
import os

In [2]:
# Define path

path = r'C:\Users\fiyin\OneDrive\Documents\InstaCart Basket Analysis'

In [3]:
# Import orders and products data

ords_prods_merged = pd.read_pickle(os.path.join(path, '02. Data', 'Prepared data', 'orders_products_merged.pkl'))

In [4]:
# Import customers data

customers = pd.read_csv(os.path.join(path, '02. Data', 'Original data', 'customers.csv'), index_col = False)

### Exploring orders and products data

In [5]:
ords_prods_merged.shape

(32399732, 22)

In [6]:
ords_prods_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32399732 entries, 0 to 32404858
Data columns (total 22 columns):
 #   Column                   Dtype
---  ------                   -----
 0   order_id                 float64
 1   user_id                  float64
 2   number_of_items_ordered  float64
 3   order_day_of_week        float64
 4   order_hour_of_day        float64
 5   days_since_prior_order   float64
 6   product_id               float64
 7   add_to_cart_order        float64
 8   reordered                float64
 9   product_name             object
 10  aisle_id                 float64
 11  department_id            float64
 12  prices                   float64
 13  price_range              object
 14  busiest_days             object
 15  busiest_period_of_day    object
 16  max_order                float64
 17  loyalty_flag             object
 18  avg_price                float64
 19  spending_habits          object
 20  median_days_last_order   float64
 21  customer_frequency       object
dtypes: float64(15), object(7)
memory usage: 5.6+ GB

In [9]:
ords_prods_merged.head()

,order_id,user_id,number_of_items_ordered,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,prices,price_range,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_habits,median_days_last_order,customer_frequency
0,2539329.0,1.0,1.0,2.0,8.0,NaN,196.0,1.0,0.0,Soda,...,9.0,Mid-range product,Regularly busy,Average orders,10.0,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795.0,1.0,2.0,3.0,7.0,15.0,196.0,1.0,1.0,Soda,...,9.0,Mid-range product,Slowest days,Average orders,10.0,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747.0,1.0,3.0,3.0,12.0,21.0,196.0,1.0,1.0,Soda,...,9.0,Mid-range product,Slowest days,Most orders,10.0,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736.0,1.0,4.0,4.0,7.0,29.0,196.0,1.0,1.0,Soda,...,9.0,Mid-range product,Slowest days,Average orders,10.0,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534.0,1.0,5.0,4.0,15.0,28.0,196.0,1.0,1.0,Soda,...,9.0,Mid-range product,Slowest days,Most orders,10.0,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [10]:
# Summary statistics

ords_prods_merged.describe()

,order_id,user_id,number_of_items_ordered,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,aisle_id,department_id,prices,max_order,avg_price,median_days_last_order
count,3.239973e+07,3.239973e+07,3.239973e+07,3.239973e+07,3.239973e+07,3.032399e+07,3.239973e+07,3.239973e+07,3.239973e+07,3.239973e+07,3.239973e+07,3.239973e+07,3.239973e+07,3.239973e+07,3.239973e+07
mean,1.710746e+06,1.029367e+05,1.714260e+01,2.738865e+00,1.342514e+01,1.110395e+01,2.559904e+04,8.352604e+00,5.895835e-01,7.119081e+01,9.918830e+00,7.790994e+00,3.305268e+01,1.186971e+01,1.039768e+01
std,9.872994e+05,5.946623e+04,1.753544e+01,2.090089e+00,4.246397e+00,8.779012e+00,1.408498e+04,7.127110e+00,4.919093e-01,3.821194e+01,6.281516e+00,4.241809e+00,2.515525e+01,8.089548e+01,7.131730e+00
min,2.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00
25%,8.559450e+05,5.142000e+04,5.000000e+00,1.000000e+00,1.000000e+01,5.000000e+00,1.354100e+04,3.000000e+00,0.000000e+00,3.100000e+01,4.000000e+00,4.200000e+00,1.300000e+01,7.387179e+00,6.000000e+00
50%,1.711052e+06,1.026140e+05,1.100000e+01,3.000000e+00,1.300000e+01,8.000000e+00,2.530500e+04,6.000000e+00,1.000000e+00,8.300000e+01,9.000000e+00,7.400000e+00,2.600000e+01,7.824688e+00,8.000000e+00
75%,2.565499e+06,1.543880e+05,2.400000e+01,5.000000e+00,1.600000e+01,1.500000e+01,3.794700e+04,1.100000e+01,1.000000e+00,1.070000e+02,1.600000e+01,1.130000e+01,4.700000e+01,8.253789e+00,1.300000e+01
max,3.421083e+06,2.062090e+05,9.900000e+01,6.000000e+00,2.300000e+01,3.000000e+01,4.968800e+04,1.450000e+02,1.000000e+00,1.340000e+02,2.100000e+01,2.500000e+01,9.900000e+01,2.500542e+04,3.000000e+01

### Consistency checks on ords_prods data

In [11]:
ords_prods_merged.shape

(32399732, 22)

In [12]:
# Checking for duplicates

ords_prods_dups = ords_prods_merged[ords_prods_merged.duplicated()]

In [13]:
ords_prods_dups

Empty DataFrame
Columns: [order_id, user_id, number_of_items_ordered, order_day_of_week, order_hour_of_day, days_since_prior_order, product_id, add_to_cart_order, reordered, product_name, aisle_id, department_id, prices, price_range, busiest_days, busiest_period_of_day, max_order, loyalty_flag, avg_price, spending_habits, median_days_last_order, customer_frequency]
Index: []

[0 rows x 22 columns]

In [16]:
# Checking missing values

ords_prods_merged.isnull().sum()

order_id                         0
user_id                          0
number_of_items_ordered          0
order_day_of_week                0
order_hour_of_day                0
days_since_prior_order     2075745
product_id                       0
add_to_cart_order                0
reordered                        0
product_name                     0
aisle_id                         0
department_id                    0
prices                           0
price_range                      0
busiest_days                     0
busiest_period_of_day            0
max_order                        0
loyalty_flag                     0
avg_price                        0
spending_habits                  0
median_days_last_order           5
customer_frequency               5
dtype: int64

### Exploring customer data

In [17]:
customers.shape

(206209, 10)

In [18]:
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [19]:
customers.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

### Cleaning and consistency checks on customers data

In [20]:
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [21]:
customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [22]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [23]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [24]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [25]:
customers.rename(columns = {'n_dependants' : 'no_of_dependants'}, inplace = True)

In [26]:
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [27]:
# Check column name changes

customers.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'no_of_dependants', 'marital_status', 'income'],
      dtype='object')

In [28]:
# Checking for missing values

customers.isnull().sum()

user_id                 0
first_name          11259
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
no_of_dependants        0
marital_status          0
income                  0
dtype: int64

In [29]:
# Checking missing values in 'first_name' column

customers[customers['first_name'].isnull()==True]

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependants,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [30]:
# Checking for duplicates

dups = customers[customers.duplicated()]

In [31]:
dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, no_of_dependants, marital_status, income]
Index: []

In [32]:
# No duplicates found

In [33]:
customers.dtypes

user_id              int64
first_name          object
last_name           object
gender              object
state               object
age                  int64
date_joined         object
no_of_dependants     int64
marital_status      object
income               int64
dtype: object

In [34]:
# Changing data type of 'user_id'

customers['user_id'] = customers['user_id'].astype('str')

In [35]:
# Changing data type of 'date_joined'

customers['date_joined'] = customers['date_joined'].astype('datetime64[ns]')

In [36]:
# Checking for mixed-type data

for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

In [37]:
# Converting 'first_name' to string

customers['first_name'] = customers['first_name'].astype('str')

In [38]:
# Check changes

customers.dtypes

user_id                     object
first_name                  object
last_name                   object
gender                      object
state                       object
age                          int64
date_joined         datetime64[ns]
no_of_dependants             int64
marital_status              object
income                       int64
dtype: object

In [39]:
# Checking variables in gender column

customers['gender'].value_counts(dropna = False)

Male      104067
Female    102142
Name: gender, dtype: int64

In [40]:
# Checking variables in marital_status column

customers['marital_status'].value_counts(dropna = False)

married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: marital_status, dtype: int64

In [41]:
# Checking unique no. of states

len(pd.unique(customers['state']))

51

In [42]:
# Frequency count for the state column

customers['state'].value_counts(dropna = False)

Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: state, dtype: int64

### Combining data

In [44]:
ords_prods_merged.shape

(32399732, 22)

In [45]:
ords_prods_merged.dtypes

order_id                   float64
user_id                    float64
number_of_items_ordered    float64
order_day_of_week          float64
order_hour_of_day          float64
days_since_prior_order     float64
product_id                 float64
add_to_cart_order          float64
reordered                  float64
product_name                object
aisle_id                   float64
department_id              float64
prices                     float64
price_range                 object
busiest_days                object
busiest_period_of_day       object
max_order                  float64
loyalty_flag                object
avg_price                  float64
spending_habits             object
median_days_last_order     float64
customer_frequency          object
dtype: object

In [47]:
# Changing data type

ords_prods_merged['user_id'] = ords_prods_merged['user_id'].astype('int')

In [48]:
# Check result

ords_prods_merged['user_id'].dtype

dtype('int32')

In [49]:
# Converting data type to string

ords_prods_merged['user_id'] = ords_prods_merged['user_id'].astype('str')

In [50]:
# Check result

ords_prods_merged['user_id'].dtype

dtype('O')

In [51]:
customers.shape

(206209, 10)

In [52]:
customers.dtypes

user_id                     object
first_name                  object
last_name                   object
gender                      object
state                       object
age                          int64
date_joined         datetime64[ns]
no_of_dependants             int64
marital_status              object
income                       int64
dtype: object

In [53]:
customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,no_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,2017-01-01,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2017-01-01,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,2017-01-01,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,2017-01-01,1,married,40374

In [56]:
# Combining orders and products data with customers data

ords_prods_cust = ords_prods_merged.merge(customers, on = 'user_id')

In [57]:
# Check merged dataframe

ords_prods_cust.head()

,order_id,user_id,number_of_items_ordered,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,customer_frequency,first_name,last_name,gender,state,age,date_joined,no_of_dependants,marital_status,income
0,2539329.0,1,1.0,2.0,8.0,NaN,196.0,1.0,0.0,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423
1,2398795.0,1,2.0,3.0,7.0,15.0,196.0,1.0,1.0,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423
2,473747.0,1,3.0,3.0,12.0,21.0,196.0,1.0,1.0,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423
3,2254736.0,1,4.0,4.0,7.0,29.0,196.0,1.0,1.0,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423
4,431534.0,1,5.0,4.0,15.0,28.0,196.0,1.0,1.0,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423

### Exporting data

In [58]:
ords_prods_cust.to_pickle(os.path.join(path, '02. Data', 'Prepared data', 'instacart_combined.pkl'))